Repository: ArthurGareginyan/my-custom-functions
Catalog: languages/*-custom-functions-*.po
Languages: es_es

source: Easily and safely add your custom functions (PHP code) directly out of your WordPress Dashboard without need of an external editor.
es_es: Añade de forma fácil y segura tus funciones personalizadas (código PHP) directamente a tu Panel de Control de WordPress sin necesidad de un editor externo.

source: <a href="https://www.arthurgareginyan.com/plugin-my-custom-functions-pro.html">Premium Version</a>
es_es: <a href="https://www.arthurgareginyan.com/plugin-my-custom-functions-pro.html">Versión Premium</a>

source: Go to plugin folder (in <code>wp-content/plugins/my-custom-functions/</code>). Rename the "<code>START</code>" file to "<code>STOP</code>". Then you can go to plugin settings page and edit your entered custom code. After editing, just rename the "<code>STOP</code>" file which you written before to "<code>START</code>".
es_es: Selecciona la carpeta del plugin (en <code>wp-content/plugins/my-custom-functions/</code>). Renombra el archivo "<code>START</code>" a "<code>STOP</code>". Luego dirígete a la página de ajustes del plugin y edita el código personalizado que ingresaste. Al terminar la edición, sólo renombra el archivo "<code>STOP</code>" que antes habías cambiado a "<code>START</code>".

source: A. Yes. But you need to do it properly, like this:
es_es: R. Sí. Pero necesitas hacerlo de forma apropiada, como puedes ver aquí:

source: A. Just place your PHP code to the field and click "Save Changes". Example of PHP code:
es_es: R. Sólo coloca tu código PHP en el campo y haz clic en "Guardar Cambios". Ejemplo de código PHP:

source: Q. Can I use HTML/CSS/JS code integrated in PHP code?
es_es: P. ¿Puedo usar código HTML/CSS/JS integrado en el código PHP?

source: Q. How does it work?
es_es: P. ¿Cómo funciona?

source: Log into Dashboard of your WordPress website.
es_es: Ingresa en el Panel de tu sitio de WordPress.

source: <a href="https://www.arthurgareginyan.com/plugin-my-custom-functions-pro.html">Get the premium version now!</a>
es_es: <a href="https://www.arthurgareginyan.com/plugin-my-custom-functions-pro.html">¡Obtener la versión premium ya!</a>

source: <strong>Pro Features</strong>
es_es: <strong>Funciones Pro</strong>

source: <strong>Consider Going Pro For Additional Features!</strong>
es_es: <strong>¡Considera actualizar a la versión PRO para disfrutar las funciones adicionales!</strong>

source: Well documented
es_es: Bien documentado

source: Sidebar items can be collapsed or expanded
es_es: Los elementos de la barra lateral se pueden cerrar o expandir

source: Button for collapse/expand the field with code
es_es: Botón para cerrar/expandir el campo con código

source: Trigger for temporary disable the certain functions
es_es: Activar para deshabilitar temporalmente ciertas funciones

source: Automatic backup of all functions to a file
es_es: Respaldo automático de todas las funciones en un archivo

source: Unlimited number of functions
es_es: Ilimitado número de funciones

source: Chinese-Taiwan (Thanks Gordon Yu)
es_es: Chino-Taiwanés (Gracias a Gordon Yu)

source: Easy disable option for WSOD
es_es: Fácil opción de deshabilitación para WSOD

source: Please keep in mind that not all translations are up to date. You are welcome to contribute!
es_es: Ten presente que no todas las traducciones están actualizadas. ¡Tu colaboración será bien recibida!

source: English (default)
es_es: Inglés (por defecto)

source: Russian
es_es: Ruso

source: Editor allow for tab indentation
es_es: Permitir en el editor la indentación por tabulador

source: Active line highlighting
es_es: Activar resaltado de línea

source: Line numbering
es_es: Numeración de línea

source: Responsive &amp; Mobile optimized settings page
es_es: Página de ajustes optimizados para Móviles

source: Translation
es_es: Traducción

source: A. Here are a few of the most likely causes of the error message:
es_es: R. Estas son algunas causas probables del mensaje de error:

source: You are trying to overwrite an existing function (of WordPress, theme, or plugin). Instead, use filters and hooks.
es_es: Estás tratando de sobreescribir una función existente (de WordPress, de tema o de plugin). Prueba usando filtros y ganchos.

source: You have entered function with a name that is already occupied by another function. Use a unique name for your function.
es_es: Has ingresado una función cuyo nombre ya está ocupado por otra función. Usa un nombre único para cada función.

source: You entered two functions with the same name. Use a unique names for your functions.
es_es: Has ingresado dos funciones con el mismo nombre. Usa nombres únicos para cada función.

source: You make a syntax error in the code that you have entered. Check the syntax of your code and try again.
es_es: Tienes un error de sintaxis en el código que has introducido. Revisa la sintaxis de tu código y prueba de nuevo.

source: Q. On the plugin settings page, an error message appears. What could be wrong?
es_es: P. En la página de ajustes del plugin aparece un mensaje de error. ¿Qué puede estar fallando?

source: On the plugin page you find the PHP editor powered by CodeMirror. It have syntax highlighting and line numbering options. Also this editor support a tab indentation.
es_es: En la página del plugin encontrarás el editor de PHP proporcionado por CodeMirror. Habilita las opciones de resaltado de sintaxis y numeración de línea. Este editor también soporta indentación por tabulador.

source: It's really useful in case of any theme update, because your custom PHP code would never be overwritten. Your custom PHP code will keep on working, no matter how many times you upgrade or switch your theme.
es_es: Es muy útil en caso de actualización de un tema, porque tu código PHP no será reescrito. Tu código PHP seguirá funcionando, sin importar el número de veces que actualices o cambies de tema.

source: Multisite network support
es_es: Soporte de red multisitio

source: Reload the settings page at same position after pushing the save button
es_es: Recarga la página de ajustes en la misma posición después de presionar el botón de guardar

source: Checks the entered code for fatal errors (simple checks)
es_es: Revisa si el código introducido produce errores fatales (revisión simple)

source: <a href="https://codemirror.net/">CodeMirror</a> is an open-source project shared under the <a href="https://codemirror.net/LICENSE">MIT license</a>.
es_es: <a href="https://codemirror.net/">CodeMirror</a> es un proyecto de código abierto compartido bajo <a href="https://codemirror.net/LICENSE">licencia del MIT</a>.

source: <strong>Credits</strong>
es_es: <strong>Créditos</strong>

source: A. Yes, any financial contributions are welcome! Just visit my website and click on the donate link, and thank you! <a href="http://www.arthurgareginyan.com/donate.html">My website</a>
es_es: R. Sí, ¡cualquier contribución financiera es bienvenida! Sólo visita mi sitio y haz clic en "donar". ¡Te lo agradezco! <a href="http://www.arthurgareginyan.com/donate.html">Mi stio web</a>

source: A. Please send me email <a href="mailto:arthurgareginyan@gmail.com">arthurgareginyan@gmail.com</a>.
es_es: R. Puedes enviarme un email <a href="mailto:arthurgareginyan@gmail.com">arthurgareginyan@gmail.com</a>.

source: A. As with every plugin, it's possible that things don't work. The most common reason for this is that the plugin has a conflict with another plugin you're using. It's impossible to tell what could be wrong exactly, but if you post a support request in the plugin's support forum on WordPress.org, I'd be happy to give it a look and try to help out. Please include as much information as possible, including a link to your website where the problem can be seen.
es_es: R. Al igual que con cualquier plugin, es posible que las cosas no funcionen. El motivo más común es que el plugin tenga un conflicto con otro plugin que estés usando. No puedo decirte exctatamente qué está fallanado, pero si me envias una solicitud en el foro de soporte del plugin en WordPress.org, estaré encantado de ayudarte. Por favor, remite la mayor cantidad de información posible, incluyendo un enlace al sitio web que presenta el problema.

source: A. Absolutely not. This plugin is added/configured entirely from the website's Admin section.
es_es: R. Absolutamente no. Este plugin se añade y se configura totalmente desde la sección Admin del sitio web.

source: Q. I love this plugin! Can I help somehow?
es_es: P. ¡Me gusta este plugin! ¿Cómo puedo ayudar?

source: Q. It's not working. What could be wrong?
es_es: P. No funciona. ¿Qué puede estar fallando?

source: Q. Does this plugin require modification to the theme?
es_es: P. ¿Este plugin requiere alguna modificación del tema?

source: "My Custom Functions" is one of the personal software projects of <a href="http://www.arthurgareginyan.com">Arthur Gareginyan</a>.
es_es: "My Custom Functions" es uno de los proyectos personales de software de <a href="http://www.arthurgareginyan.com">Arthur Gareginyan</a>.

source: <a href="http://www.arthurgareginyan.com">Developer Website</a>
es_es: <a href="http://www.arthurgareginyan.com">Sitio web del desarrollador</a>

source: <strong>Links</strong>
es_es: <strong>Enlaces</strong>

source: This plugin is licensed under the <a href="http://www.gnu.org/licenses/gpl-3.0.html">GNU General Public License, version 3 (GPLv3)</a> and is distributed free of charge. Commercial licensing (e.g. for projects that can’t use an open-source license) is available upon request.
es_es: Este plugin está bajo licencia <a href="http://www.gnu.org/licenses/gpl-3.0.html">GNU General Public License, version 3 (GPLv3)</a> y se distribuye sin costo alguno. Para licencias comerciales (por ejemplo, proyectos que no pueden usar una licencia de código abierto) está disponible por solicitud.

source: <strong>License</strong>
es_es: <strong>Licencia</strong>

source: <a href="https://github.com/ArthurGareginyan/my-custom-functions">Dedicated Plugin Page on GitHub</a>
es_es: <a href="https://github.com/ArthurGareginyan/my-custom-functions">Página en GitHub dedicada al plugin</a>

source: Other Notes
es_es: Otras acotaciones

source: A. Please visit <a href="https://github.com/ArthurGareginyan/my-custom-functions">Dedicated Plugin Page on GitHub</a> and report.
es_es: P. Por favor visita <a href="https://github.com/ArthurGareginyan/my-custom-functions">La página en GitHub dedicada al plugin</a> y haz un reporte.

source: This plugin stored you entered code in the Database of your website. For getting your code, you also can go to the <code>Database</code> —&gt; Table "<code>wp_options</code>" —&gt; Option "<code>anarcho_cfunctions_settings</code>" —&gt; "<code>option_value</code>".
es_es: Este plugin almacena el código que hayas ingresado en la Base de datos de tu sitio web. Para obtener tu código, también puedes ir a <code>Database</code> —&gt; Table "<code>wp_options</code>" —&gt; Option "<code>anarcho_cfunctions_settings</code>" —&gt; "<code>option_value</code>".

source: A. This plugin is not perfect, so there are times when the entered custom code causes the error and white screen (WSOD). If this happened with you then do the following.
es_es: R. Este plugin no es perfecto, por tanto existe la posibilidad de que el código personalizado que ingresasate cause error y una pantalla en blanco (WSOD). Si te ocurre esto, haz lo siguiente.

source: A. Yes. But If your language is not available then you can make one. This plugin is ready for translation. The <code>.pot</code> file is included and placed in "<code>languages</code>" folder. Many of plugin users would be delighted if you shared your translation with the community. Just send the translation files (<code>*.po, *.mo</code>) to me at the arthurgareginyan@gmail.com and I will include the translation within the next plugin update.
es_es: R. Sí. Pero si tu idioma no está disponible, puedes hacerlo. Este plugin está listo para traducción. El archivo <code>.pot</code> está en la carpeta "<code>languages</code>". Muchos usuarios estarían encantados de que compartas tu traducción con la comunidad. Sólo envíame los archivos de traducción (<code>*.po, *.mo</code>) a arthurgareginyan@gmail.com y yo incluiré la traducción en la próxima actualización del plugin.

source: A. I don't limit the number of characters.
es_es: R. No se limita el número de caracteres.

source: A. Sorry, this plugin is available for use only on self-hosted (WordPress.org) websites.
es_es: R. Lo siento, este plugin está disponible sólo para sitios web hechos en WordPress.org que tengan hospedaje propio.

source: Q. Where to share any ideas or suggestions to make the plugin better?
es_es: P: ¿Dónde puedo compartir ideas o sugerencias para mejorar este plugin?

source: Q. Where to report bug if found?
es_es: P. ¿Dónde puedo reportar un error que haya encontrado?

source: Q. What to do if this plugin caused the white screen?
es_es: P: ¿Qué hago si este plugin causa una pantalla en blanco?

source: Q. Can I use this plugin on my language?
es_es: P. ¿Puedo usar este plugin en mi idioma?

source: Q. How much of PHP code (characters) I can enter in the text field?
es_es: P: ¿Cuántos caracteres de código PHP puedo entrar en el campo de texto?

source: Q. Will this plugin work on my WordPress.COM website?
es_es: P. ¿Este plugin funcionará en mi sitio web hecho en WordPress.com?

source: <a href="http://codex.wordpress.org/Managing_Plugins#Installing_Plugins" title="WordPress Codex: Installing Plugins">More help installing Plugins</a>
es_es: <a href="http://codex.wordpress.org/Managing_Plugins#Installing_Plugins" title="WordPress Codex: Installing Plugins">Más ayuda sobre instalación de plugins</a>

source: After installation, a "<code>Custom Functions</code>" menu item will appear in the "<code>Appearance</code>" section. Click on this in order to view plugin's administration page.
es_es: Después de la instalación, aparecerá una opción de menú "<code>Custom Functions</code>" en la sección "<code>Appearance</code>". Haz clic para entrar en la página de configuración del plugin.

source: Manual via FTP:
es_es: Manual vía FTP:

source: Automatically via WordPress:
es_es: Automáticamente vía WordPress:

source: Install "My Custom Functions" just as you would any other WordPress Plugin.
es_es: Instala "My Custom Functions" como lo haces con cualquier plugin de WordPress.

source: Upload the unzipped catalog to your website's plugin directory (<code>/wp-content/plugins/</code>).
es_es: Sube el catálogo descomprimido al directorio de plugins de tu sitio web (<code>/wp-content/plugins/</code>).

source: Unzip the ZIP file.
es_es: Descomprime el archivo ZIP.

source: Download a copy (ZIP file) of this plugin from WordPress.org.
es_es: Descarga una copia (el archivo ZIP) de este plugin desde WordPress.org.

source: Activate this plugin through the "<code>Plugins</code>" tab.
es_es: Activa este plugin desde la pestaña "<code>Plugins</code>".

source: Find this plugin and click install.
es_es: Busca el plugin y haz clic en Install.

source: Go to "<code>Plugins</code>" —&gt; "<code>Add New</code>".
es_es: Dirígete a "<code>Plugins</code>" —&gt; "<code>Add New</code>".

source: <strong>Coming soon:</strong>
es_es: <strong>Pronto:</strong>

source: This is a simple and perfect tool to use as your site's functionality plugin.
es_es: Esta es una herramienta sencilla e ideal para usar como plugin de funciones en tu sitio.

source: It's purpose is to provide a familiar experience to WordPress users. No need anymore editing the functions.php file of your theme. Just add your PHP code in the field on the plugin page and this plugin will do the rest for you.
es_es: Su propósito es ofrecer una experiencia familiar a los usuarios de WordPress. Ya no tendrás que editar el archivo functions.php de tu tema. Sólo añade el código PHP en el campo correspondiente en la página de configuración del plugin y él hará el resto por ti.

source: An easy to use WordPress plugin that gives you the ability to easily and safely add your custome functions (PHP code) for execution in WordPress environment directly out of your WordPress Dashboard and without any need of an external editor.
es_es: Un plugin de WordPress fácil de usar que te permite añadir de forma segura tus funciones personalizadas (en código PHP) para ejecutarlas en el ambiente de WordPress directamente desde tu Panel de Control en WordPress, sin necesidad de un editor externo.

source: Trigger for temporary disable the custom functions
es_es: Activar para deshabilitar temporalmente las funciones personalizadas

source: Ready for translation (POT file included)
es_es: Listo para traducción (archivo POT incluido)

source: Syntax highlighting (by CodeMirror)
es_es: Resaltado de sintaxis (por CodeMirror)

source: Features
es_es: Funciones

source: «Fatal error» message.
es_es: Mensaje «Error fatal».

source: Success message.
es_es: Mensaje de ejecución exitosa.

source: Plugin page with custom code added.
es_es: Página del plugin con el código personalizado añadido.

source: Plugin page.
es_es: Página del plugin.

source: Russian translation improved.
es_es: Traducción al ruso mejorada.

source: Added global constant for plugin text-domain.
es_es: Inlcuye una constante global para el dominio de texto del plugin.

source: User's PHP code displayed on settings page are escaped for output by <code>htmlentities()</code> instead of <code>esc_attr()</code> for prevent converting characters to HTML entities.
es_es: El código PHP del usuario mostrado en la página de ajustes se remite en la salida de <code>htmlentities()</code> en vez de <code>esc_attr()</code> para prevenir que los caracteres se conviertan en entidades HTML.

source: Added the Readme.txt file for translation contribution.
es_es: Archivo Readme.txt incluido para contribuciones de traducción.

source: The Readme.txt file improved.
es_es: El archivo Readme.txt mejorado.

source: On the settings page added an advertisement about the PRO version of this plugin.
es_es: En la página de ajustes se incluye una publicidad sobre la versión PRO de este plugin.

source: Style sheet of settings page improved.
es_es: Página de Hoja de estilos mejorada.

source: Added option for easy disable the custom code for cases of WSOD.
es_es: Incluye una opción de fácil uso para deshabilitar el código personalizado en caso de WSOD.

source: Added constant for storing the plugin version number.
es_es: Añade una constante para almacenar el número de versión del plugin.

source: Added prefixes to the stylesheet and script names when using wp_enqueue_style() and wp_enqueue_script().
es_es: Prefijos agregados a los nombres de hojas de estilo y de scripts cuando use wp_enqueue_style() and wp_enqueue_script().

source: Chinese (Taiwan) translation updated.
es_es: Traducción a chino (Taiwan) actualizada.

source: POT file updated.
es_es: Archivo POT actualizado.

source: The "thanks.png" image removed.
es_es: Removida la imagen "thanks.png".

source: JS code improved.
es_es: Código JS mejorado.

source: Style sheet of settings page improved and better commented.
es_es: Hoja de estilo de ajustes mejorada y mejor documentada.

source: The structure of files changed.
es_es: Se cambió la estructura de archivos.

source: The update_option() returned into _duplicates function.
es_es: Update_option() ahora está en la la función into _duplicates.

source: Added function of automatic remove the "successful" message after 3 seconds.
es_es: Función añadida para quitar automáticamente el mensaje de "operación exitosa" después de 3 segundos.

source: Added function to check for duplicate function names. Compares the names of all functions (internal, user). The _duplicates function added.
es_es: Función añadida para revisar nombres de función duplicados. Compara los nombres de todas las funciones (internas y del usuario). Se agregó la función _duplicates.

source: The _enqueue_codemirror_scripts function renamed to mcstyles_load_scripts.
es_es: La función _enqueue_codemirror_scripts ahora se llama mcstyles_load_scripts.

source: The styles.css file better commented.
es_es: El archivo styles.css está mejor comentado.

source: Styles of settings page optimized for mobile devices.
es_es: La página de ajustes ahora está optimizada para dispositivos móviles.

source: CSS class "slider" renamed to "trigger".
es_es: Clase "slider" de CSS se renombró a "trigger".

source: The _exec function optimized.
es_es: La función _exec fue optimizada.

source: Extra update_option() removed from the _duplicates function.
es_es: La opción adicional update_option() fue removida de la función _duplicates.

source: Added active-line add-on to CodeMirror.
es_es: Se agregó la extensión de línea activa para CodeMirror.

source: Functions _prepare, _duplicates, and _exec optimized.
es_es: Las funciones _prepare, _duplicates y _exec fueron optimizadas.

source: Added trigger for temporary disable the custom functions.
es_es: Se añadió un ´trigger´para deshabilitar temporalmente las funciones personalizadas.

source: Removed my personal ad about freelance.
es_es: Removí mi publicidad personal como freelance.

source: File js-functions.js renamed to functions.js.
es_es: El archivo js-functions.js se renombró como functions.js.

source: The function of user code cleaning modified.
es_es: La función de limpiar el código del usuario fue modificada.

source: Removed the default message about successful saving.
es_es: El mensaje por defecto de guardado exitoso fue eliminado.

source: Added compatibility with the translate.wordpress.org.
es_es: Ahora es compatible con translate.wordpress.org.

source: Text domain changed to "my-custom-functions".
es_es: El dominio de texto cambió a "my-custom-functions".

source: Added Chinese (Taiwan) translation. (Thanks Gordon Yu)
es_es: Incluye traducción al chino (Taiwan). (Gracias a Gordon Yu)

source: Image "btn_donateCC_LG.gif" is now located in the "images" directory.
es_es: La imagen "btn_donateCC_LG.gif" ahora está en el directorio "images".

source: All images are moved to the directory "images".
es_es: Todas las imágenes se movieron al directorio "images".

source: Removed extra rules in style.css file.
es_es: Se quitaron reglas extra en el archivo style.css.

source: In the settings_page.php, on the line 21, fixed typo.
es_es: En el archivo settings_page.php, en la línea 21, se corrigió el typo.

source: Added my personal ad about freelance.
es_es: Agregada mi publicidad personal como freelance.

source: Plugin URI changed to GitHub repository.
es_es: La URL del plugin cambió al repositorio de GitHub.

source: Text domain changed to "MCFunctions".
es_es: El dominio de texto cambió a "MCFunctions".

source: Prefixes changed to "MCFunctions".
es_es: Prefijos cambiados a "MCFunctions".

source: js-functions.js (file with all js functions) created.
es_es: Se creó el archivo js-functions.js (contiene todas las funciones js).

source: editor.js deleted.
es_es: Eliminado editor.js.

source: Constants variables added.
es_es: Añadidas variables/constantes.

source: New design of settings page (new layout).
es_es: Nuevo diseño de la página de ajustes.

source: Russian translation updated.
es_es: Actualizada la traducción al ruso.

source: .pot file updated.
es_es: Archivo .pot actualizado.

source: Localization improved.
es_es: Mejorada la localización.

source: Donate link changed.
es_es: El enlace para donación cambió.

source: Authors URI changed.
es_es: La URL de los autores cambió.

source: Removed more unused do_action() from settings_page.php file.
es_es: Removida unused do_action() del archivo settings_page.php.

source: Placeholder of changed to "/* Enter Your Custom Functions Here */".
es_es: Marcador de posición cambiado a "/* Ingrese aquí sus funciones personalizadas */".
