Repository: ArthurGareginyan/my-custom-functions
Catalog: languages/*-custom-functions-*.po
Languages: es_es

source: The mode of CodeMirror editor changed from 'application/x-httpd-php' (HTML+PHP) to 'text/x-php' (PHP).
es_es: El modo de editor CodeMirror varió de 'application/x-httpd-php' (HTML+PHP) a 'text/x-php' (PHP).

source: Alfa version.
es_es: Versión Alfa.

source: Beta version.
es_es: Versión beta.

source: Added ready for translation.
es_es: Ahora está listo para traducción.

source: Added the check for safety execution code.
es_es: Se agregó la verificación para una ejecución de código más segura.

source: Initial release.
es_es: Versión inicial.

source: Fixed positioning of the sidebar at the plugin page.
es_es: Posición fija en la barra lateral de la página del plugin.

source: Added the syntax highlighting and line numbering.
es_es: Se incorporó el resaltado de sintaxis y la numeración de línea.

source: Minor fixes.
es_es: Arreglos menores.

source: .pot file included.
es_es: Archivo .pot incluido.

source: Fixed the issue due to which the alert message was appearing after installation.
es_es: Se corrigió el error que mostraba un mensaje de alerta después de la instalación.

source: Corrected comments to source code.
es_es: Comentarios corregidos en el código fuente.

source: Added "register_setting" for error option.
es_es: Añadido "register_setting" para opciones de error.

source: Fixed the issue due to which nothing appears below line 26 until you click below that line.
es_es: Se corrigió la falla por la cual no aparecía nada debajo de la línea 26 hasta que hacías clic debajo de esa línea.

source: The LICENSE file renamed to LICENSE.txt
es_es: El archivo LICENSE se renombró a LICENSE.txt

source: Changed the style of title in plugin's page.
es_es: Cambió el estilo del título en la página del plugin.

source: Textdomain changed to "mcfunctions".
es_es: El dominio de texto cambió a "mcfunctions".

source: The javascript from settings_page.php moved to separate file.
es_es: El javascript del archivo settings_page.php fue movido a un archivo separado.

source: The stylesheet of plugin's page moved to separate file.
es_es: La hoja de estilo de la página del plugin se movió a un archivo separado.

source: CodeMirror scripts are combined and minified.
es_es: Los scripts CodeMirror se combinaron y fueron minificados.
