Repository: ArthurGareginyan/my-custom-functions
Catalog: languages/mcfunctions-*.po
Languages: ru_ru

source: Custom functions updated successfully.
ru_ru: Пользовательские функции успешно обновлены.

source: Sorry, but your code causes a "Fatal error", so it is not applied!
ru_ru: Извините, но ваш код вызывает "Fatal error", так что он не будет применён!

source: Please, check the code and try again.
ru_ru: Пожалуйста, проверьте код и попробуйте еще раз.

source: by <a href="http://www.arthurgareginyan.com" target="_blank">Arthur "Berserkr" Gareginyan</a>
ru_ru: от <a href=“http://www.arthurgareginyan.com” target=“_blank”>Артур “Berserkr” Гарегинян</a>

source: This plugin allows you to EASILY and SAFELY add your own functions, snippets or any custom code to your site.
ru_ru: Этот плагин позволяет легко и безопасно добавлять свои собственные функции, сниппеты или любой пользовательский код на ваш веб-сайт.

source: To use, enter your custom functions, then click "Update Custom Functions". It's that simple!
ru_ru: Для использования, введите ваши пользовательские функции, затем нажмите кнопку "Обновить Пользовательские Функции". Это так просто!

source: Update Custom Functions
ru_ru: Обновить Пользовательские Функции

source: If you find it useful, consider making a donation:
ru_ru: Если вы находите её полезной, рассмотрите возможность сделать пожертвование:

source: Settings
ru_ru: Настройки

source: Custom Functions
ru_ru: Пользовательские Функции

source: EASILY and SAFELY add your own functions, snippets or any custom codes directly out of your WordPress Dashboard without need of an external editor.
ru_ru: ПРОСТО и БЕЗОПАСНО добавляйте свои собственные функции, сниппеты или любые пользовательские коды непосредственно из вашего WordPress Dashboard без необходимости во внешнем редакторе.

source: Arthur "Berserkr" Gareginyan
ru_ru: Артур “Берсерк” Гарегинян
